###############################################################################
# Created by write_sdc
# Sat May 27 16:29:07 2023
###############################################################################
current_design tt_ctrl
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ctrl_ena}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ctrl_sel_inc}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ctrl_sel_rst_n}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_ui_in[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_ow[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {k_one}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {k_zero}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_oe_n[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uio_out[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pad_uo_out[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spine_iw[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {k_one}]
set_load -pin_load 0.0334 [get_ports {k_zero}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[7]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[6]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[5]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[4]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[3]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[2]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[1]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_oe_n[0]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[7]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[6]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[5]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[4]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[3]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[2]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[1]}]
set_load -pin_load 0.0334 [get_ports {pad_uio_out[0]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[7]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[6]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[5]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[4]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[3]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[2]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[1]}]
set_load -pin_load 0.0334 [get_ports {pad_uo_out[0]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[30]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[29]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[28]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[27]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[26]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[25]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[24]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[23]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[22]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[21]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[20]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[19]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[18]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[17]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[16]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[15]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[14]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[13]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[12]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[11]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[10]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[9]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[8]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[7]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[6]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[5]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[4]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[3]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[2]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[1]}]
set_load -pin_load 0.0334 [get_ports {spine_iw[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ctrl_ena}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ctrl_sel_inc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ctrl_sel_rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_ui_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pad_uio_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spine_ow[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
